In [2]:
import pandas as pd
df = pd.read_csv("data.csv")

In [3]:
df.head()

,id,date,first_name,last_name,email,gender,ip_address,country,price_paid,tax
0,1,03/28/2021,Marylin,Alders,malders0@shop-pro.jp,Male,160.119.8.119,Canada,$5.36,NaN
1,2,03/19/2021,Hinda,Harridge,hharridge1@gnu.org,Female,210.51.172.132,Canada,$8.32,NaN
2,3,03/17/2021,Erl,Kilminster,ekilminster2@etsy.com,Male,213.8.101.145,United States,$3.73,20.0
3,4,03/19/2021,Grata,Brantl,gbrantl3@umn.edu,Female,5.140.237.101,United States,$3.70,20.0
4,5,03/24/2021,Kanya,Beasant,kbeasant4@jigsy.com,Male,106.252.162.233,Morocco,$9.24,20.0

In [4]:
df.email

0            malders0@shop-pro.jp
1              hharridge1@gnu.org
2           ekilminster2@etsy.com
3                gbrantl3@umn.edu
4             kbeasant4@jigsy.com
                  ...
995          derrigorn@elpais.com
996         arastallro@toplist.cz
997    bstickelsrp@cloudflare.com
998        ptesoerq@rakuten.co.jp
999         rpringuerrr@house.gov
Name: email, Length: 1000, dtype: object

In [5]:
df['email']

0            malders0@shop-pro.jp
1              hharridge1@gnu.org
2           ekilminster2@etsy.com
3                gbrantl3@umn.edu
4             kbeasant4@jigsy.com
                  ...
995          derrigorn@elpais.com
996         arastallro@toplist.cz
997    bstickelsrp@cloudflare.com
998        ptesoerq@rakuten.co.jp
999         rpringuerrr@house.gov
Name: email, Length: 1000, dtype: object

In [6]:
df.email.head()

0     malders0@shop-pro.jp
1       hharridge1@gnu.org
2    ekilminster2@etsy.com
3         gbrantl3@umn.edu
4      kbeasant4@jigsy.com
Name: email, dtype: object

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
type(df.gender)

pandas.core.series.Series

In [9]:
df[0:7]

,id,date,first_name,last_name,email,gender,ip_address,country,price_paid,tax
0,1,03/28/2021,Marylin,Alders,malders0@shop-pro.jp,Male,160.119.8.119,Canada,$5.36,NaN
1,2,03/19/2021,Hinda,Harridge,hharridge1@gnu.org,Female,210.51.172.132,Canada,$8.32,NaN
2,3,03/17/2021,Erl,Kilminster,ekilminster2@etsy.com,Male,213.8.101.145,United States,$3.73,20.0
3,4,03/19/2021,Grata,Brantl,gbrantl3@umn.edu,Female,5.140.237.101,United States,$3.70,20.0
4,5,03/24/2021,Kanya,Beasant,kbeasant4@jigsy.com,Male,106.252.162.233,Morocco,$9.24,20.0
5,6,03/25/2021,Titos,Braybrooke,tbraybrooke5@umn.edu,Female,173.100.21.179,United States,$5.82,NaN
6,7,03/14/2021,Ava,Kencott,akencott6@phoca.cz,Female,118.251.45.43,Canada,$6.29,NaN

In [10]:
df.loc[0:7]

,id,date,first_name,last_name,email,gender,ip_address,country,price_paid,tax
0,1,03/28/2021,Marylin,Alders,malders0@shop-pro.jp,Male,160.119.8.119,Canada,$5.36,NaN
1,2,03/19/2021,Hinda,Harridge,hharridge1@gnu.org,Female,210.51.172.132,Canada,$8.32,NaN
2,3,03/17/2021,Erl,Kilminster,ekilminster2@etsy.com,Male,213.8.101.145,United States,$3.73,20.0
3,4,03/19/2021,Grata,Brantl,gbrantl3@umn.edu,Female,5.140.237.101,United States,$3.70,20.0
4,5,03/24/2021,Kanya,Beasant,kbeasant4@jigsy.com,Male,106.252.162.233,Morocco,$9.24,20.0
5,6,03/25/2021,Titos,Braybrooke,tbraybrooke5@umn.edu,Female,173.100.21.179,United States,$5.82,NaN
6,7,03/14/2021,Ava,Kencott,akencott6@phoca.cz,Female,118.251.45.43,Canada,$6.29,NaN
7,8,03/08/2021,Codi,Feasley,cfeasley7@ed.gov,Male,26.190.191.249,France,$3.01,20.0

In [12]:
df.email[3:9]

3         gbrantl3@umn.edu
4      kbeasant4@jigsy.com
5     tbraybrooke5@umn.edu
6       akencott6@phoca.cz
7         cfeasley7@ed.gov
8    wheersema8@tumblr.com
Name: email, dtype: object

In [13]:
df.email.loc[3:9]

3         gbrantl3@umn.edu
4      kbeasant4@jigsy.com
5     tbraybrooke5@umn.edu
6       akencott6@phoca.cz
7         cfeasley7@ed.gov
8    wheersema8@tumblr.com
9    ggookes9@amazon.co.uk
Name: email, dtype: object

In [14]:
df.set_index("email", inplace=True)
df.loc["gbrantl3@umn.edu" : "cfeasley7@ed.gov" ]

,id,date,first_name,last_name,gender,ip_address,country,price_paid,tax
email,,,,,,,,,
gbrantl3@umn.edu,4,03/19/2021,Grata,Brantl,Female,5.140.237.101,United States,$3.70,20.0
kbeasant4@jigsy.com,5,03/24/2021,Kanya,Beasant,Male,106.252.162.233,Morocco,$9.24,20.0
tbraybrooke5@umn.edu,6,03/25/2021,Titos,Braybrooke,Female,173.100.21.179,United States,$5.82,NaN
akencott6@phoca.cz,7,03/14/2021,Ava,Kencott,Female,118.251.45.43,Canada,$6.29,NaN
cfeasley7@ed.gov,8,03/08/2021,Codi,Feasley,Male,26.190.191.249,France,$3.01,20.0

In [16]:
row = df.loc["cfeasley7@ed.gov"]

In [33]:
row

id                         8
date              03/08/2021
first_name              Codi
last_name            Feasley
gender                  Male
ip_address    26.190.191.249
country               France
price_paid             $3.01
tax                     20.0
Name: cfeasley7@ed.gov, dtype: object

In [17]:
type(row)

pandas.core.series.Series

In [18]:
row.gender

'Male'

In [25]:
row.index.tolist()

['id',
 'date',
 'first_name',
 'last_name',
 'gender',
 'ip_address',
 'country',
 'price_paid',
 'tax']

In [27]:
row.values

array([8, '03/08/2021', 'Codi', 'Feasley', 'Male', '26.190.191.249',
       'France', '$3.01', 20.0], dtype=object)

In [28]:
row.values.tolist()

[8,
 '03/08/2021',
 'Codi',
 'Feasley',
 'Male',
 '26.190.191.249',
 'France',
 '$3.01',
 20.0]

In [32]:
df.loc["cfeasley7@ed.gov"].values.tolist()

[8,
 '03/08/2021',
 'Codi',
 'Feasley',
 'Male',
 '26.190.191.249',
 'France',
 '$3.01',
 20.0]

In [35]:
df.loc[["cfeasley7@ed.gov" , "gbrantl3@umn.edu"]]

,id,date,first_name,last_name,gender,ip_address,country,price_paid,tax
email,,,,,,,,,
cfeasley7@ed.gov,8,03/08/2021,Codi,Feasley,Male,26.190.191.249,France,$3.01,20.0
gbrantl3@umn.edu,4,03/19/2021,Grata,Brantl,Female,5.140.237.101,United States,$3.70,20.0

In [47]:
df.groupby("gender").mean()

                id   tax
gender
Female  493.154158  20.0
Male    503.614155  20.0